{
  "problem": "graduation requirements",
  "description": "The goal is to express the graduation requirements (in natural language) as Datalog rules.",
  "input_spec": [
    "The graduation requirements in natural language taken from a university website. Put in json format with \\n for newlines.",
    "Reference examples on how to express logic in Datalog."
  ],
  "output_spec": "A Datalog program, including facts and rules, that captures the graduation requirements.",
  "output_language": "datalog",
  "_more_instructions": "For the graduation requirements, consider first generating facts from the text. For example, you can create facts such as course(course_id, credit) (e.g., course(CSE114, 3)) from the text input. You can assume each course is 3 credits if not specified.",
  "input": "Requirements for the Major\nThe major in Computer Science leads to the Bachelor of Science degree.  Completion of the major requires approximately 80 credits.  At least 24 credits from items 1 to 3 below, and at least 18 credits from items 2 and 3, must be completed at Stony Brook. \n1. Required Introductory Courses\nCSE 114 Introduction to Object-Oriented Programming\nCSE 214 Data Structures\nCSE 215 Foundations of Computer Science or CSE 150 Foundations of Computer Science: Honors\nCSE 216 Programming Abstractions\nCSE 220 Systems Fundamentals I\nNote: Students may substitute the four courses CSE 160, CSE 161, CSE 260 and CSE 261 for the three courses CSE 114, CSE 214 and CSE 216.\n2. Required Advanced Courses\nCSE 303 Introduction to the Theory of Computation or CSE 350 Theory of Computation: Honors\nCSE 310 Computer Networks\nCSE 316 Fundamentals of Software Development\nCSE 320 Systems Fundamentals II\nCSE 373 Analysis of Algorithms or CSE 385 Analysis of Algorithms: Honors\nCSE 416 Software Engineering\n3. Computer Science Electives\nFour upper-division technical CSE electives, each of which must carry at least three credits. Technical electives do not include teaching practica (CSE 475), the senior honors project (CSE 495, 496), and courses designated as non-technical in the course description (such as CSE 301).\n4. AMS 151, AMS 161 Applied Calculus I, II\nNote: The following alternate calculus course sequences may be substituted for AMS 151, AMS 161 in major requirements or prerequisites: MAT 125, MAT 126, MAT 127, or MAT 131, MAT 132. Equivalency for MAT courses achieved through the Mathematics Placement Examination is accepted to meet MAT course requirements.\n5. One of the following:\nMAT 211 Introduction to Linear Algebra\nAMS 210 Applied Linear Algebra\n6. Both of the following:\nAMS 301 Finite Mathematical Structures\nAMS 310 Survey of Probability and Statistics or AMS 311 Probability Theory \n7. At least one of the following natural science lecture/laboratory combinations:\nBIO 201/204 or BIO 202/204 or BIO 203/204 or CHE 131/133 or CHE 152/154 or PHY 126/133 or PHY 131/133 or PHY 141/133\n8. Additional natural science courses selected from above and the following list:\nAST 203, AST 205, CHE 132, CHE 321, CHE 322, CHE 331, CHE 332, GEO 102, GEO 103, GEO 112, GEO 113, GEO 122, PHY 125, PHY 127, PHY 132, PHY 134, PHY 142, PHY 251, PHY 252\n\nNote: The courses selected in 7 and 8 must carry at least 9 credits.\n9. Professional Ethics\nCSE 312 Social, Legal, and Ethical Issues in Computing\n10. Upper-Division Writing Requirement: CSE 300 Technical Communications\nAll degree candidates must demonstrate technical writing skills at a level that would be acceptable in an industrial setting. To satisfy the requirement, students must pass CSE 300, a course that requires the completion of various writing assign­ments, including at least one significant technical paper.\nNote: All students are encouraged to discuss their program with an undergraduate advisor. In Requirement 2 above, CSE/ESE double majors may substitute ESE 440, ESE 441 Electrical Engineering Design I, II for CSE 416 Software Engineering provided that the design project contains a significant software component. Approval of the Department of Computer Science is required.\nGrading\nAll courses taken to satisfy Requirements 1 through 10 must be taken for a letter grade. The courses in Requirements 1-6, 9, and 10 must be passed with a letter grade of C or higher. The grade point average for the courses in Requirements 7 and 8 must be at least 2.00."
}
